[
{"title": "Plant", "image": "https://cdn.britannica.com/s:700x500/23/60423-050-A24B296C/Weeping-willow.jpg", "p_tag_list": ["Plant, (kingdom Plantae), any multicellular eukaryotic life-form characterized by (1) photosynthetic nutrition (a characteristic possessed by all plants except some parasitic plants and underground orchids), in which chemical energy is produced from water, minerals, and carbon dioxide with the aid of pigments and the radiant energy of the Sun, (2) essentially unlimited growth at localized regions, (3) cells that contain cellulose in their walls and are therefore to some extent rigid, (4) the absence of organs of locomotion, resulting in a more or less stationary existence, (5) the absence of nervous systems, and (6) life histories that show an alteration of haploid and diploid generations, with the dominance of one over the other being taxonomically significant.", "Plants range in size from diminutive duckweeds only a few millimetres in length to the giant sequoias of California that reach 90 metres (300 feet) or more in height. There are an estimated 390,900 different species of plants known to science, and new species are continually being described, particularly from previously unexplored tropical areas of the world. Plants evolved from aquatic ancestors and have subsequently migrated over the entire surface of Earth, inhabiting tropical, Arctic, desert, and Alpine regions. Some plants have returned to an aquatic habitat in either fresh or salt water.", "Plants play a vital role in the maintenance of life on Earth. All energy used by living organisms depends on the complex process of photosynthesis, which is mostly carried out by green plants. Radiant energy from the Sun is transformed into organic chemical energy in the form of sugars through the fundamental series of chemical reactions constituting photosynthesis. In nature all food chains begin with photosynthetic autotrophs (primary producers), including green plants and algae. Primary producers, represented by trees, shrubs, and herbs, are a prolific source of energy in the form of carbohydrates (sugars) stored in the leaves. These carbohydrates, produced in photosynthesis, are broken down in a process called respiration; the smaller units of the sugar molecule and its products fuel numerous metabolic processes. Various parts of the plant (e.g., leaves) are the energy sources that support animal life in different community habitats. A by-product of photosynthesis, oxygen, is essential to animals.", "The daily existence of human beings is also directly influenced by plants. Plants furnish food and flavourings; raw materials for industry, such as wood, resins, oils, and rubber; fibres for the manufacture of fabrics and cordage; medicines; insecticides; and fuels. More than half of Earth’s population relies on the grasses rice, corn (maize), and wheat as their primary source of food. Apart from their commercial and aesthetic value, plants conserve other natural resources by protecting soils from erosion, by controlling water levels and quality, and by producing a favourable atmosphere.", "The following article summarizes the morphological, physiological, and ecological features of plants. The principal focus is on structure and function, physiology, life histories, and ecology, and on how the various plant groups have evolved, dispersed, and become adapted to life on land. The features that define each major plant group and the role they play in the wider ecosystem also are discussed."]},
{"title": "Garlic", "image": "https://cdn.britannica.com/s:700x500/37/174537-050-950EE618/Bulbs-cloves-garlic.jpg", "p_tag_list": ["Garlic, (Allium sativum), perennial plant of the amaryllis family (Amaryllidaceae), grown for its flavourful bulbs. The plant is native to central Asia but grows wild in Italy and southern France and is a classic ingredient in many national cuisines. The bulbs have a powerful onionlike aroma and pungent taste and are not usually eaten raw.", "Garlic plants grow about 60 cm (2 feet) tall. Depending on the variety, the long leaves typically arise from a short hard stem above the bulb or emerge from a softer pseudostem made up of overlapping leaf sheaths. The bulb is covered with membranous skin and encloses up to 20 edible bulblets called cloves. The spherical flower cluster is initially enclosed in a pair of papery tapered bracts; the bracts split open when the green-white or pinkish flowers bloom. Flower stalks sometimes arise bearing tiny bulbils (tiny secondary bulbs that form in place of flowers) and sterile blossoms. Garlic is usually grown as an annual crop and is propagated by planting cloves or top bulbils, though seeds can be also be used.", "In ancient and medieval times, garlic was prized for its medicinal properties and was carried as a charm against vampires and other evils. The plant is used in traditional and folk medicine in many places, and there is some evidence that it may help prevent heart disease. Garlic contains about 0.1 percent essential oil, the principal components of which are diallyl disulfide, diallyl trisulfide, and allyl propyl disulfide."]},
{"title": "Onion", "image": "https://cdn.britannica.com/s:800x450,c:crop/92/186992-138-CE41AE87/onions-eyes-tears.jpg", "p_tag_list": ["Onion, (Allium cepa), herbaceous biennial plant in the amaryllis family (Amaryllidaceae), grown for its edible bulb. The onion is likely native to southwestern Asia but is now grown throughout the world, chiefly in the temperate zones. Onions are low in nutrients but are valued for their flavour and are used widely in cooking. They add flavour to such dishes as stews, roasts, soups, and salads and are also served as a cooked vegetable.", "The common onion has one or more leafless flower stalks that reach a height of 75–180 cm (2.5–6 feet), terminating in a spherical cluster of small greenish white flowers. The concentric leaf bases of the developing plant swell to form the underground edible bulb. Most commercially cultivated onions are grown from the plant’s small black seeds, which are sown directly in the field, but onions may also be grown from small bulbs or from transplants. Onions are very hardy and can survive in a wide range of growing conditions. The bulbs vary in size, shape, colour, and pungency, though warmer climates generally produce onions with a milder, sweeter flavour than do other climates. The onion’s characteristic pungency results from the sulfur-rich volatile oil it contains; the release of this oil during peeling or chopping brings tears to the eyes.", "Onions are among the world’s oldest cultivated plants. They were probably known in India, China, and the Middle East before recorded history. Ancient Egyptians regarded the spherical bulb as a symbol of the universe, and its name is probably derived from the Latin unus, meaning “one.” The Romans introduced the onion to Britain and, in the New World, Native Americans added a highly pungent wild onion to their stews. Curative powers have been attributed to onions throughout the centuries; they have been used in folk medicine for such varied ailments as colds, earaches, laryngitis, animal bites, burns, and warts.", "Most whole onions are slightly dried before marketing, making their skins dry and paper-thin. Onions are also available in various processed forms. Boiled and pickled onions are packed in cans or jars. Frozen onions are available chopped or whole, and bottled onion juice is sold for use as a flavouring. Dehydrated onion products have been available since the 1930s; such products include granulated, ground, minced, chopped, and sliced forms. Onion powder is made by grinding dehydrated onions and is sometimes packaged in combination with salt. Dried onion products are used in a variety of prepared foods and are also sold directly to the consumer for use as condiments.", "There are a number of commercial varieties and cultivars of onions available:"]},
{"title": "Beet", "image": "https://cdn.britannica.com/s:700x500/96/122496-004-92D6EEC9/Beets.jpg", "p_tag_list": ["Beet, (Beta vulgaris), any of the four cultivated forms of the plant Beta vulgaris (family Amaranthaceae), grown for their edible leaves and roots. Each of the four distinct types of B. vulgaris is used differently: (1) the common garden beet (also called beetroot or table beet) is cultivated as a garden vegetable; (2) Swiss chard (also called leaf beet or silver beet) is grown for its nutrient-rich leaves; (3) the sugar beet is commercially important as a major source of sugar; and (4) mangel-wurzel, or mangold, is a succulent feed for livestock.", "Beets are most extensively grown in temperate to cool regions or during the cooler seasons. The growing season varies from 8 to 10 weeks for garden beets in favourable climates to 30 weeks for some mangel-wurzels. Beets grow best in deep loose soils that are high in organic matter; they respond well to chemical fertilizers and manures. Grown extensively under irrigation, beets tolerate a relatively high salt content of the soil but are sensitive to high acidity and to a low content of boron. Boron deficiency retards growth and causes black lesions in the root flesh.", "The garden beet is primarily grown for the thick fleshy taproot that forms during the first season. In the second season a tall, branched, leafy stem arises to bear clusters of minute green flowers that develop into brown corky fruits commonly called seedballs. The taproot ranges in shape from globular to long and tapered. Skin and flesh colours are usually dark purplish red, though some are nearly white. Beet roots are a good source of riboflavin as well as folate, manganese, and the antioxidant betaine. Beet roots should be smooth, firm, and unblemished; medium-sized specimens are the most tender. They are frequently canned, either whole or cut up, and often are pickled, spiced, or served in a sweet-and-sour sauce. The leaves of garden beets can be cooked or eaten fresh if picked while young.", "Swiss chard is a popular garden plant with edible leaves and stalks and is commonly eaten in many Mediterranean countries. The leaves are dark green, and stalks range in colour from white to yellow to red. Slightly bitter tasting, Swiss chard is usually cooked and is frequently used in soups. Beet greens, from both the garden beet and Swiss chard, are a source of riboflavin, iron, and vitamins A, C, and K.", "The sugar beet is the most economically important of the four beet varieties. Developed in Germany in the 18th century, its European cultivation received important encouragement from Napoleon as a means of combating the British blockade of imported sugar. Capable of accumulating up to 22 percent sucrose in its root, sugar beets account for about one-third of the world’s sugar production.", "Cultivation of the mangel-wurzel dates from prehistoric times. While primarily used as animal feed, mangel-wurzel has gained popularity as a garden vegetable, as both the root and the leaves are edible. The pale roots average 4 kg (9 pounds) each, though some have been reported up to 20 kg (44 pounds). Similar to sugar beets, mangel-wurzel has a high sucrose content."]},
{"title": "Potato", "image": "https://cdn.britannica.com/s:800x450,c:crop/07/180107-138-EF167746/Overview-potato.jpg", "p_tag_list": ["Potato, (Solanum tuberosum), annual plant in the nightshade family (Solanaceae), grown for its starchy edible tubers. The potato is native to the Peruvian-Bolivian Andes and is one of the world’s main food crops. Potatoes are frequently served whole or mashed as a cooked vegetable and are also ground into potato flour, used in baking and as a thickener for sauces. The tubers are highly digestible and supply vitamin C, protein, thiamin, and niacin.", "Potatoes are thought to have been independently domesticated several times and were largely cultivated in South America by the Incas as early as 1,800 years ago. Encountered by the invading Spaniards, potatoes were introduced into Europe during the second half of the 16th century. By the end of the 17th century the plant was a major crop in Ireland, and by the end of the 18th century it was a major crop in continental Europe, particularly Germany, and in the west of England. It continued to spread, in both Western and Eastern hemispheres, during the first four decades of the 19th century, and the Irish economy itself became dependent upon the potato. However, the disastrous failures of the Irish crops in the mid-19th century (especially in 1846 and 1848), because of late blight (Phytophthora infestans), and the resulting Irish Potato Famine generated a more-cautious attitude toward dependence on the plant.", "The potato is one of some 150 tuber-bearing species of the genus Solanum (a tuber is the swollen end of an underground stem). The compound leaves are spirally arranged; each leaf is 20–30 cm (about 8–12 inches) long and consists of a terminal leaflet and two to four pairs of leaflets. The white, lavender, or purple flowers have five fused petals and yellow stamens. The fruit is a small poisonous berry with numerous seeds.", "The stems extend underground into structures called stolons. The ends of the stolons may enlarge greatly to form a few to more than 20 tubers, of variable shape and size, usually ranging in weight up to 300 grams (10 ounces) but occasionally to more than 1.5 kg (3.3 pounds). The skin varies in colour from brownish white to deep purple; the starchy flesh normally ranges in colour from white to yellow, but it too may be purple. The tubers bear spirally arranged buds (eyes) in the axils of aborted leaves, of which scars remain. The buds sprout to form clones of the parent plant, allowing growers to vegetatively propagate desired characteristics. Indeed, vegetative reproduction is always used commercially, though the resulting decrease in genetic diversity has made the popular varieties more vulnerable to pests and diseases."]},
{"title": "Brussels sprouts", "image": "https://cdn.britannica.com/s:700x500/01/122501-050-ABED4F1C/Brussels-sprouts.jpg", "p_tag_list": ["Brussels sprouts, (Brassica oleracea, variety gemmifera), form of cabbage, belonging to the mustard family Brassicaceae, widely grown in Europe and North America for its edible buds called “sprouts.” Brussels sprouts may have been grown in Belgium as early as 1200, but the first recorded description of it dates to 1587. Brussels sprouts usually are eaten cooked, and the small young sprouts have a more delicate flavour than older ones. The vegetable is a good source of dietary fibre, folic acid, manganese, and vitamins A, C, and K.", "In its seedling stage and early development, the plant closely resembles the common cabbage, but the main stem grows to a height of 60 to 90 cm (2 to 3 feet), and the axillary buds along the stem develop into small heads (sprouts) similar to heads of cabbage but measuring only 25 to 40 mm (1 to 1.6 inches) in diameter. Most varieties have green sprouts, but red-leaved varieties have also been developed. Though commonly grown as annuals, Brussels sprouts are biennial plants and will produce yellow flowers with four petals if kept for two seasons. Seeds are borne in silique fruits. The plant requires a mild cool climate and is harmed by hot weather."]},
{"title": "Carrot", "image": "https://cdn.britannica.com/s:700x500/05/122505-004-F2DA5352/Carrots.jpg", "p_tag_list": ["Carrot, (Daucus carota), herbaceous, generally biennial plant of the Apiaceae family that produces an edible taproot. Among common varieties root shapes range from globular to long, with lower ends blunt to pointed. Besides the orange-coloured roots, white-, yellow-, and purple-fleshed varieties are known.", "Wild carrot (subspecies D. carota carota, also called Queen Anne’s lace) is native to Eurasia and is thought to have been domesticated in Central Asia around 1000 ce. Prehistoric seeds have been found in archaeological digs, suggesting that the plant was used medicinally before the domestication of its edible root. Carrots were cultivated in China and northwestern Europe by the 13th century, and wild carrot was unintentionally distributed as a weed in the United States during European colonization. Domesticated carrots (subspecies D. carota sativus) are now extensively grown throughout temperate zones. In the 20th century, knowledge of the value of carotene (provitamin A) increased appreciation of the carrot, a rich source of the nutrient.", "The plants require cool to moderate temperatures and are not grown in summer in the warmer regions. They require deep, rich, but loosely packed soil. Modern machines sow the seeds sparsely in bands to give room for plant development without need for thinning. An erect rosette of doubly compound, finely divided leaves develops above ground normally in the first season. The edible carrot and attached roots are below. If left unharvested, the plant survives through the winter, and large branched flower stalks arise the following growing season. The tiny white or pinkish flowers are borne on large compound clusters (umbels) at the ends of the main stalk and branches. The spiny seeds are produced in small segmented fruits called schizocarps. Seeds that are sold for planting have the spines removed.", "Fresh carrots should be firm and crisp, with smooth and unblemished skin. Bright-orange colour indicates high carotene content; smaller types are the most tender. Carrots are used in salads and as relishes and are served as cooked vegetables and in stews and soups."]},
{"title": "Asparagus", "image": "https://cdn.britannica.com/s:700x500/93/174593-050-7E342B58/Young-garden-asparagus-plants-Asparagus-officinalis.jpg", "p_tag_list": ["Asparagus, (genus Asparagus), genus of the family Asparagaceae with up to 300 species native from Siberia to southern Africa. Best known is the garden asparagus (Asparagus officinalis), cultivated as a vegetable for its succulent spring stalks. Several African species are grown as ornamental plants."]},
{"title": "Sweet potato", "image": "https://cdn.britannica.com/s:700x500/40/119540-050-93BB8999/potatoes.jpg", "p_tag_list": ["Sweet potato, (Ipomoea batatas), food plant of the morning glory family (Convolvulaceae), native to tropical America. The sweet potato is widely cultivated in tropical and warm temperate climates and is an important food crop in the southern United States, tropical America and the Caribbean, the warmer islands of the Pacific, Japan, and parts of Russia. The fleshy roots are served as a cooked vegetable, in whole or mashed form, and are used as pie filling. In Japan the crop has long been grown for drying and for manufacture of starch and alcohol.", "Sweet potato stems are usually long and trailing and bear lobed or unlobed leaves that vary in shape. The flowers, borne in clusters in the axils of the leaves, are funnel-shaped and tinged with pink or rose-violet. The edible part is the much-enlarged tuberous root, varying in shape from fusiform to oblong or pointed oval. Root colours range from white to orange and occasionally purple inside and from light buff to brown or rose and purplish red outside. The pulp consists largely of starch, and orange-fleshed varieties are high in carotene. Propagated vegetatively by sprouts arising from the roots or by cuttings of the vines, the plant is best adapted to light, friable soils such as sandy loams. At least four to five months of warm weather are required for large yields.", "The sweet potato must not be confused with the common potato (Solanum tuberosum, family Solanaceae) or with the yam (various Dioscorea species, family Dioscoreaceae), to which it is botanically unrelated."]},
{"title": "Cabbage", "image": "https://cdn.britannica.com/s:700x500/26/78226-050-1760E39F/compounds-Head-cabbage-isothiocyanates-root-fly-sensory.jpg", "p_tag_list": ["Cabbage, (Brassica oleracea), vegetable and fodder plant of the mustard family (Brassicaceae), the various agricultural forms of which have been developed by long cultivation from the wild cabbage (Brassica oleracea). The edible portions of all cabbage forms—which include kale, broccoli, and Brussels sprouts—are low in calories and are an excellent source of vitamin C. Head cabbage, generally designated simply “cabbage,” is a major table vegetable in most countries of the temperate zone.", "All forms of cabbage have succulent leaves that are free of hairs and covered with a waxy coating, which often gives the leaf surface a gray-green or blue-green colour. The plants grow best in mild to cool climates and tolerate frost; some forms tolerate hard freezing at certain periods of growth. Hot weather impairs growth and quality. The common forms of cabbage may be classified according to the plant parts used for food and the structure or arrangement of those parts, as follows.", "Head cabbage is one of the most economically significant forms of the plant. Hard-headed cabbage was developed in northern Europe during the Middle Ages, and soft-headed cabbages, such as savoy, are believed to have originated earlier in southern Europe. The heads of horticultural varieties of head cabbage range in shape from pointed through globular to flat; from soft to hard in structure; through various shades of green, gray-green, and magenta or red; and from less than 1 kg to more than 3 kg (2–7 pounds) in weight. The less-hard varieties must be used more or less promptly after harvest for salads, in cookery, or for the manufacture of sauerkraut, whereas the very hard late-maturing Danish type is suited to winter storage.", "The so-called Chinese cabbages, including bok choy (Brassica rapa, variety chinensis) and napa cabbage (B. rapa, variety pekinensis), are forms of a related species."]},
{"title": "Celery", "image": "https://cdn.britannica.com/s:700x500/68/143768-050-108B71EC/Celery.jpg", "p_tag_list": ["Celery, (Apium graveolens), herbaceous plant of the parsley family (Apiaceae). Celery is usually eaten cooked as a vegetable or as a delicate flavouring in a variety of stocks, casseroles, and soups. In the United States raw celery is served by itself or with spreads or dips as an appetizer and in salads. The tiny seedlike fruits, known as celery seed, resemble the plant itself in taste and aroma and are used as a seasoning, particularly in soups and pickles.", "Native to the Mediterranean areas and the Middle East, celery was used as a flavouring by the ancient Greeks and Romans and as a medicine by the ancient Chinese. The ancient forms resembled smallage, or wild celery. Celery with large, fleshy, succulent, upright leafstalks, or petioles, was developed in the late 18th century. The stringiness that characterizes most celery has been eliminated from some varieties.", "Celeriac (Apium graveolens variety rapaceum), also called celery root or turnip-rooted celery, has a large edible root used as a raw or cooked vegetable."]},
{"title": "Lettuce", "image": "https://cdn.britannica.com/s:700x500/77/170677-050-F7333D51/lettuce.jpg", "p_tag_list": ["Lettuce, (Lactuca sativa), annual leaf vegetable of the aster family (Asteraceae). Most lettuce varieties are eaten fresh and are commonly served as the base of green salads. Lettuce is generally a rich source of vitamins K and A, though the nutritional quality varies, depending on the variety.", "Four botanical varieties of lettuce are cultivated: (1) celtuce, or asparagus lettuce (variety augustana), with narrow leaves and a thick, succulent, edible stem; (2) head, or cabbage, lettuce (variety capitata), with the leaves folded into a compact head; (3) leaf, or curled, lettuce (variety crispa), with a rosette of leaves that are curled, finely cut, smooth-edged, or oak-leaved in shape; and (4) cos, or romaine, lettuce (variety longifolia), with smooth leaves that form a tall, oblong, loose head. There are two classes of head lettuce: the butterhead types, such as Bibb lettuce, with soft heads of thick oily-textured leaves, and crisphead types, such as iceberg lettuce, with brittle-textured leaves that form very hard heads under proper temperature conditions.", "Lettuce plants can have taproots or fibrous root systems. The leaves of domesticated varieties come in a wide range of colours, from shades of green to deep red and purple; variegated varieties have also been developed. Lettuces are harvested prior to flowering, as the “bolting” of the flower stalk elongates head lettuce, reduces the size of the leaves, and imparts a bitter flavour. The yellow flower heads produce achene fruits with feathery pappus structures for wind dispersal.", "For successful cultivation, lettuce requires ample water, especially in warmer weather. During unseasonable weather, protection is furnished and growth stimulated with greenhouses, frames, cloches, or polyethylene covers. In many parts of the world, the cos, leaf, and butterhead types are most popular, though some varieties are difficult to ship and are commonly grown on truck farms or market gardens relatively close to markets. The crisphead varieties, well adapted for long-distance shipment, are popular in the United States."]},
{"title": "Parsley", "image": "https://cdn.britannica.com/s:800x450,c:crop/97/180197-138-14536BA9/Overview-parsley.jpg", "p_tag_list": ["Parsley, (Petroselinum crispum), hardy biennial herb of the family Apiaceae, or Umbelliferae, native to Mediterranean lands. Parsley leaves were used by the ancient Greeks and Romans as a flavouring and garnish for foods. The compound leaves—deep green, tender, and curled or deeply frilled—that develop in a cluster the first season of growth are used fresh or dried, the mildly aromatic flavour being popular in fish, meats, soups, sauces, and salads. Parsley is often the principal ingredient of bouquet garni and fines herbes.", "In the second season of growth, seed stalks rise about 1 metre (3.3 feet) tall and are topped by compound umbels of small, greenish yellow flowers followed by tiny fruits, or seeds, similar to those of a carrot but without spines. Parsley seedlings are small and weak; they emerge with difficulty from heavy crusty soils.", "Parsley contains less than 0.5 percent essential oil, the principal component of which is a pungent, oily, green liquid called apiol.", "Hamburg parsley, or turnip-rooted parsley (Petroselinum crispum, variety tuberosum), is grown for its large white parsniplike root, which is popular in Europe."]},
{"title": "Broccoli", "image": "https://cdn.britannica.com/s:700x500/15/136015-050-42C0D895/Broccoli.jpg", "p_tag_list": ["Broccoli, Brassica oleracea, variety italica, form of cabbage, of the mustard family (Brassicaceae), grown for its edible flower buds and stalk. Native to the eastern Mediterranean and Asia Minor, sprouting broccoli was cultivated in Italy in ancient Roman times and was introduced to England and America in the 1700s. High in dietary fibre and a number of vitamins and minerals, including potassium, folic acid, and vitamins A, C, and K, broccoli is a nutritious vegetable and can be eaten fresh or cooked. Fresh broccoli should be dark green in colour, with firm stalks and compact bud clusters.", "Broccoli is a fast-growing annual plant that grows 60–90 cm (24–35 inches) tall. Upright and branching with leathery leaves, broccoli bears dense green clusters of flower buds at the ends of the central axis and the branches. If left unharvested, those buds bear yellow flowers with four petals and produce silique fruits (a dry capsule). Broccoli thrives in moderate to cool climates and is propagated by seeds, either sown directly in the field or in plant beds to produce transplants. The heads, or florets, reach harvest in 60 to 150 days, depending upon the variety and the weather."]},
{"title": "Spinach", "image": "https://cdn.britannica.com/s:800x450,c:crop/80/192580-138-BE5ADB2E/spinach-explosives-countries.jpg", "p_tag_list": ["Spinach, (Spinacia oleracea), hardy leafy annual of the amaranth family (Amaranthaceae), used as a vegetable. Widely grown in northern Europe and the United States, spinach is marketed fresh, canned, and frozen. It received considerable impetus as a crop in the 1920s, when attention was first called to its high content of iron and vitamins A and C. Spinach is served as a salad green and as a cooked vegetable.", "The edible leaves are arranged in a rosette, from which a seed stalk emerges. The simple leaves are somewhat triangular or ovate and may be flat or puckered. The flowers are inconspicuous and produce small dry fruits. Spinach requires cool weather and deep, rich, well-limed soil to give quick growth and maximum leaf area. Seed can be sown every two weeks from early spring to late summer, in rows 30 cm (12 inches) apart, the plantlets being thinned in the row. The last sowings produce young plants that yield a crop in the autumn and stand over the winter, providing leaves in early spring or even through the winter if the weather is not too severe."]},
{"title": "Chive", "image": "https://cdn.britannica.com/s:700x500/40/142140-050-E6AD9A8B/Chives.jpg", "p_tag_list": ["Chive, (Allium schoenoprasum), small perennial plant of the amaryllis family (Amaryllidaceae), related to the onion. Chives are grown as ornamentals for their attractive flowers and as a potherb for their flavourful leaves. The leaves can be used fresh or dried and are a common seasoning for eggs, soups, salads, and vegetables.", "Chives bear small white elongated bulbs and thin tubular leaves, which grow in clumps. Dense spherical umbels of bluish or lilac flowers rise above the foliage. They characteristically produce only a few seeds. Chives may be propagated by planting seeds but are cultivated more commonly by dividing the clumps and planting the tiny bulbs."]},
{"title": "Rhubarb", "image": "https://cdn.britannica.com/s:700x500/87/9587-004-BCB91CAA/Rhubarb.jpg", "p_tag_list": ["Rhubarb, (Rheum rhabarbarum), also called pieplant, a hardy perennial of the smartweed family (Polygonaceae), native to Asia and grown for its large edible leafstalks. Rhubarb is commonly grown in cool areas of the temperate zones. The plant’s fleshy, tart, and highly acidic leafstalks are used in pies, often with strawberries, in compotes and preserves, and sometimes as the base of a wine or an aperitif. The leaves contain toxins, including oxalic acid, and are not eaten.", "Rhubarb produces large clumps of enormous leaves, up to 60 cm (2 feet) across. The leaves are borne on proportionately large petioles, or leafstalks, which are 25 mm (1 inch) or more in diameter and up to 60 cm in length and arise from an underground stem. The leaves appear early in the spring. Later in the season a large central flower stalk may appear and bear numerous small greenish white flowers and angular winged fruits containing one seed. The roots withstand cold well, although the tops die back in autumn.", "The roots of Chinese rhubarb (Rheum officinale and R. palmatum) have been used medicinally in China and Tibet since ancient times, primarily as a cathartic. Their purgative properties and yellow colour are derived from anthracene glycosides; they also contain high levels of calcium oxalate, which give a characteristic grittiness."]},
{"title": "Cauliflower", "image": "https://cdn.britannica.com/s:700x500/24/140624-004-3AE0A596/Cauliflower-plant-form-cauliflower-cabbage-flower-structures.jpg", "p_tag_list": ["Cauliflower, (Brassica oleracea, variety botrytis), highly modified form of cabbage in the mustard family (Brassicaceae), grown for its edible masses of partially developed flower structures and fleshy stalks. Cauliflower is high in vitamins C and K and is frequently served as a cooked vegetable or used raw in salads and relishes.", "Cauliflowers are annual plants that reach about 0.5 metre (1.5 feet) tall and bear large rounded leaves that resemble collards (Brassica oleracea, variety acephala). As desired for food, the terminal cluster forms a firm, succulent “curd,” or head, that is an immature inflorescence (cluster of flowers). The broad leaves extend far above the curd and are often tied together before harvest to shade the curd and prevent discoloration. Commercially, white cauliflower is the most common, though orange, purple, green, and brown cultivars also exist. The plants produce cross-shaped yellow flowers and bear seeds in dry capsules known as siliques.", "Cauliflower is a cool-weather crop and requires consistent temperatures of about 16 °C (60 °F) to produce heads. The plants grow best in moist nitrogen-rich soil and will produce only small heads if stressed with drought. Clubroot, a fungal disease, is a common problem for cauliflower crops, and the plants are fairly susceptible to a number of foliage-eating insects, including cabbage loopers, cabbage whites, and aphids."]},
{"title": "Artichoke", "image": "https://cdn.britannica.com/s:700x500/16/191616-050-6FF60400/artichoke-heads-sale.jpg", "p_tag_list": ["Artichoke, (Cynara cardunculus, variety scolymus), also called globe artichoke or French artichoke, large thistlelike perennial plant of the aster family (Asteraceae) grown for its edible flower buds. The thick bracts and the receptacle of the immature flower head, known as the heart, are a culinary delicacy. The artichoke’s flavour is delicate and nutlike, and the smaller heads, or buds, are usually the most tender. Artichoke heads are served as a hot vegetable with a sauce or as a cold salad or appetizer.", "Native to the western and central Mediterranean, the artichoke was domesticated and carried to the eastern Mediterranean in ancient times, though it was then valued for its young leaves rather than the immature flower heads. The edible-flower form was first recorded in Italy around 1400, and today it is extensively cultivated in Mediterranean countries, the Americas, and other regions with the necessary rich soil and mild, humid climate.", "Artichoke plants feature deeply toothed large leaves that grow up to one metre (three feet) long and that die each year after flowers are formed. The plants produce rosettes of sturdy branched flower stalks with purple flower heads. After four to eight years the cluster of rosettes becomes crowded, and the size and quality of the heads become reduced. The plant is then renewed by planting divisions of the rosette crown or rooted offshoots. Although the mature flower heads produce seeds, the seedlings do not necessarily resemble the variety of the parent plant, so vegetative propagation is preferred.", "The Jerusalem artichoke (Helianthus tuberosus) is grown for its edible tubers and does not resemble the artichoke."]},
{"title": "Pea", "image": "https://cdn.britannica.com/s:700x500/90/9690-004-302C9896/Pea.jpg", "p_tag_list": ["Pea, (Pisum sativum), also called garden pea, herbaceous annual plant in the family Fabaceae, grown virtually worldwide for its edible seeds. Peas can be bought fresh, canned, or frozen, and dried peas are commonly used in soups. Some varieties, including sugar peas and snow peas, produce pods that are edible and are eaten raw or cooked like green beans; they are popular in East Asian cuisines. The plants are fairly easy to grow, and the seeds are a good source of protein and dietary fibre.", "While the origins of domesticated peas have not been definitely determined, the pea is one of the oldest cultivated crops. The wild plant is native to the Mediterranean region, and ancient remains dating to the late Neolithic Period have been found in the Middle East. European colonization introduced the crop to the New World and other regions throughout the globe. In the mid-1800s, peas in a monastery garden in Austria were famously used by the monk Gregor Mendel in his pioneering studies of the nature of heredity.", "The pea plant is a hardy leafy annual with hollow trailing or climbing stems that reach up to 1.8 metres (6 feet) in length. The stems feature terminal tendrils that facilitate climbing and bear compound leaves with three pairs of leaflets. The reddish purple, pink, or white flowers, growing two to three per stalk, are butterfly-shaped. The fruit is a pod that grows to 10 cm (4 inches) long, splitting in half when ripe. Inside the pod, 5 to 10 seeds are attached by short stalks. The seeds are green, yellow, white, or variegated.", "In the home garden, peas should be planted in fertile well-drained soil in an unshaded spot. The cool part of the growing season favours growth and development, and peas are sometimes grown in the winter and early spring in warmer climates. The most common diseases that affect peas are root rot, powdery mildew, and several viral diseases. Widely grown varieties include dwarf, half-dwarf, trailing, smooth-seeded, and wrinkled-seeded. Canning and freezing processes vary according to variety, plant size, shape and size of the pods, and period of maturation.", "The black-eyed pea (Vigna unguiculata) is not a true pea. See cowpea."]},
{"title": "Lima bean", "image": "https://cdn.britannica.com/s:700x500/36/125436-004-FABACD88/Lima-beans.jpg", "p_tag_list": ["Lima bean, (Phaseolus lunatus), any of a variety of legumes(family Fabaceae) widely cultivated for their edible seeds. Of Central American origin, the lima bean is of commercial importance in few countries outside the Americas. There is a wide range of pod size and shape and of seed size, shape, thickness, and colour in both bush and climbing forms. The pods are wide, flat, and slightly curved. The lima bean itself is readily distinguished by the characteristic fine ridges in the seed coat that radiate from the “eye.” The plant grows as a perennial in the tropics and is normally cultivated as an annual elsewhere. It requires a longer season and warmer weather than most varieties of common bean. Butter beans and giant white beans are some well-known varieties of lima bean. See alsobean."]},
{"title": "Eggplant", "image": "https://cdn.britannica.com/s:700x500/64/143464-050-B0EC6714/Eggplant.jpg", "p_tag_list": ["Eggplant, (Solanum melongena), also called aubergine or Guinea squash, tender perennial plant of the nightshade family (Solanaceae), grown for its edible fruits. Eggplant requires a warm climate and has been cultivated in its native Southeast Asia since remote antiquity. A staple in cuisines of the Mediterranean region, eggplant figures prominently in such classic dishes as the Greek moussaka, the Italian eggplant parmigiana, and the Middle Eastern relish baba ghanoush. It is also frequently served as a baked, grilled, fried, or boiled vegetable and is used as a garnish and in stews. The plant is closely related to the tomato (Solanum lycopersicum) and the potato (S. tuberosum) as well as to several poisonous nightshades.", "Eggplant is usually grown as an annual and features an erect bushy stem that is sometimes armed with spines. The leaves are large, ovate, and slightly lobed. The pendant violet flowers are characteristically solitary and approximately 5 cm (2 inches) across. The fruit is a large egg-shaped berry with a glossy surface that varies in colour from dark purple to red, pink, yellowish, or white and is sometimes striped; the colour and shape of the white variety is the source of the common name."]},
{"title": "Cucumber", "image": "https://cdn.britannica.com/s:700x500/48/12548-004-68A15563/Cucumber.jpg", "p_tag_list": ["Cucumber, (Cucumis sativus), creeping plant of the gourd family (Cucurbitaceae), widely cultivated for its edible fruit. The nutritional value of the cucumber is low, but its delicate flavour makes it popular for salads and relishes. Small fruits are often pickled. The cucumber can be grown in frames or on trellises in greenhouses in cool climates and is cultivated as a field crop and in home gardens in warmer areas.", "The cucumber plant is a tender annual with a rough, succulent, trailing stem. The hairy leaves have three to five pointed lobes, and the stem bears branched tendrils by which the plant can be trained to supports. The five-petaled yellow flowers are unisexual and produce a type of berry known as a pepo. The heat requirement is one of the highest among the common vegetables, and the fruits can become bitter if exposed to uneven watering conditions. The plants are susceptible to a number of bacterial and fungal diseases, including downy mildew, anthracnose, and Fusarium wilt.", "The related gherkin (Cucumis anguria) is grown outdoors principally for pickling."]},
{"title": "Pepper", "image": "https://cdn.britannica.com/s:700x500/14/147314-050-5E573B11/pimiento-peppers.jpg", "p_tag_list": ["Pepper, (genus Capsicum), genus of more than 30 species of flowering plants in the nightshade family (Solanaceae), several of which are extensively cultivated for their edible, often pungent fruits. The genus comprises all the varied forms of fleshy-fruited peppers, including the mild bell peppers that are used as a vegetable and the hot peppers, such as habanero and tabasco, that are used as relishes, pickled, or ground into a fine powder for use as a spice. Some peppers are grown as ornamentals.", "Peppers are native to tropical America and are particularly important in the cuisines of tropical Asia and equatorial America. Traces of pepper fruits have been found in prehistoric remains in Peru and Mexico, and the plants were widely grown in Central and South America by various pre-Columbian civilizations. Originally mistaken for a form of black pepper (Piper nigrum), the first pepper seeds were carried to Spain in 1493 and from there spread rapidly throughout Europe and the rest of the world.", "Pepper plants are perennials but are grown as tender summer annuals in most areas outside their native habitat. They are propagated by seeding directly in the soil or by transplanting seedlings started in greenhouses or hotbeds after 6 to 10 weeks. The plants become woody as the growing season progresses and bear simple, alternately arranged leaves with smooth margins. The paired or solitary flowers are typically small with five white petals. The fruit is a berry. Pepper fruits come in a variety of shapes and sizes, ranging from the small and nearly circular ají charapita to the long and thin tabasco pepper and to the large, furrowed fruits of the bell pepper.", "Hot peppers derive their pungency from capsaicin, a substance characterized by acrid vapours and burning taste. Capsaicin is primarily concentrated in the internal partitions of the fruit and was first isolated in 1876; it is known to stimulate gastric secretions."]},
{"title": "Corn", "image": "https://cdn.britannica.com/s:800x450,c:crop/22/174122-138-FF404399/video-sweet-corn-germination.jpg", "p_tag_list": ["Corn, (Zea mays), also called Indian corn or maize, cereal plant of the grass family (Poaceae) and its edible grain. The domesticated crop originated in the Americas and is one of the most widely distributed of the world’s food crops. Corn is used as livestock feed, as human food, as biofuel, and as raw material in industry. In the United States the colourful variegated strains known as Indian corn are traditionally used in autumn harvest decorations.", "Corn was first domesticated by native peoples in Mexico about 10,000 years ago. Native Americans taught European colonists to grow the indigenous grains, and, since its introduction into Europe by Christopher Columbus and other explorers, corn has spread to all areas of the world suitable to its cultivation. It is grown from 58° N latitude in Canada and Russia to 40° S latitude in South America, with a corn crop maturing somewhere in the world nearly every month of the year. It is the most important crop in the United States and is a staple food in many places.", "The corn plant is a tall annual grass with a stout, erect, solid stem. The large narrow leaves have wavy margins and are spaced alternately on opposite sides of the stem. Staminate (male) flowers are borne on the tassel terminating the main axis of the stem. The pistillate (female) inflorescences, which mature to become the edible ears, are spikes with a thickened axis, bearing paired spikelets in longitudinal rows; each row of paired spikelets normally produces two rows of grain. Varieties of yellow and white corn are the most popular as food, though there are varieties with red, blue, pink, and black kernels, often banded, spotted, or striped. Each ear is enclosed by modified leaves called shucks or husks. Many industrial varieties of corn are genetically modified for resistance to the herbicide glyphosate or to produce proteins from Bacillus thuringiensis (Bt) to kill specific insect pests. In addition, some strains have been genetically engineered for greater drought tolerance.", "Commercial classifications, based mainly on kernel texture, include dent corn, flint corn, flour corn, sweet corn, and popcorn. Dent corn is characterized by a depression in the crown of the kernel caused by unequal drying of the hard and soft starch making up the kernel. Flint corn, containing little soft starch, has no depression. Flour corn, composed largely of soft starch, has soft, mealy, easily ground kernels. Sweet corn has wrinkled translucent seeds; the plant sugar is not converted to starch as in other types. Popcorn, an extreme type of flint corn characterized by small hard kernels, is devoid of soft starch, and heating causes the moisture in the cells to expand, making the kernels explode. Improvements in corn have resulted from hybridization, based on crossbreeding of superior inbred strains.", "Although it is a major food in many parts of the world, corn is inferior to other cereals in nutritional value. Its protein is of poor quality, and it is deficient in niacin. Diets in which it predominates often result in pellagra (niacin-deficiency disease). Its gluten (elastic protein) is of comparatively poor quality, and it is not used to produce leavened bread. It is widely used, however, in Latin American cuisine to make masa, a kind of dough used in such staple foods as tortillas and tamales. Given that corn flour is gluten-free, it cannot be used alone to make rising breads. In the United States corn is boiled or roasted on the cob, creamed, converted into hominy (hulled kernels) or meal, and cooked in corn puddings, mush, polenta, griddle cakes, cornbread, and scrapple. It is also used for popcorn, confections, and various manufactured cereal preparations.", "Corn is also used to produce ethanol (ethyl alcohol), a first-generation liquid biofuel. In the United States corn ethanol is typically blended with gasoline to produce “gasohol,” an automotive fuel that is 10 percent ethanol. Although corn-based biofuels were initially touted as environmentally friendly alternatives to petroleum, their production diverts arable land and feedstock from the human food chain, sparking a “food versus fuel” debate. Cellulosic ethanol, which is made from nonedible plant parts such as agricultural waste, has a smaller impact on the food chain than corn ethanol, though the conversion technology is generally less efficient than that of first-generation biofuels.", "Many parts of the corn plant are used in industry. Cornstarch can be broken down into corn syrup, a common sweetener that is generally less expensive than sucrose; high-fructose corn syrup is used extensively in processed foods such as soft drinks and candies. Stalks are made into paper and wallboard; husks are used as filling material; cobs are used directly for fuel, to make charcoal, and in the preparation of industrial solvents. Corn grain is processed by wet milling, in which the grain is soaked in a dilute solution of sulfurous acid; by dry milling, in which the corn is exposed to a water spray or steam; and by fermentation, in which starches are changed to sugars and yeast is employed to convert the sugars into alcohol. Corn husks also have a long history of use in the folk arts for objects such as woven amulets and corn-husk dolls."]},
{"title": "Tomato", "image": "https://cdn.britannica.com/s:700x500/68/185168-050-C00C6AAE/Variety-heirloom-tomatoes.jpg", "p_tag_list": ["Tomato, (Solanum lycopersicum), flowering plant of the nightshade family (Solanaceae), cultivated extensively for its edible fruits. Labelled as a vegetable for nutritional purposes, tomatoes are a good source of vitamin C and the phytochemical lycopene. The fruits are commonly eaten raw in salads, served as a cooked vegetable, used as an ingredient of various prepared dishes, and pickled. Additionally, a large percentage of the world’s tomato crop is used for processing; products include canned tomatoes, tomato juice, ketchup, puree, paste, and “sun-dried” tomatoes or dehydrated pulp."]}
]